app/views/lists/show.html.erb

<ul>
	<% @list.tasks.incomplete.each do |task| %>
---
SELECT `tasks`.* FROM `tasks` WHERE (`tasks`.list_id = 1)

<ul id="completed">
	<% @list.tasks.completed.each do |task| %>
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`completed` = 0 AND (`tasks`.list_id = 1)