app/controllers/lists_controller.rb

  def index
    respond_with(@lists = List.all)
---
SELECT `lists`.* FROM `lists`

  def create
    @list = List.new(params[:list])
    if @list.save
---
INSERT INTO `lists` (`name`, `description`, `created_at`, `updated_at`) VALUES ('Work', 'Things I have to do at Work', '2012-08-11 09:01:52', '2012-08-11 09:01:52')

  def show
    @list = List.find(params[:id])
---
SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 3 LIMIT 1

  def edit
    @list = List.find(params[:id])
---
SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 1 LIMIT 1

  def update
    @list = List.find(params[:id])
    if @list.update_attributes(params[:list])
---
SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 1 LIMIT 1
UPDATE `lists` SET `name` = 'London Home', `description` = 'Things I have to do at London Home', `updated_at` = '2012-08-11 09:21:54' WHERE `lists`.`id` = 1

  def destroy
    @list = List.find(params[:id])
    if @list.destroy
---
SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 4 LIMIT 1
DELETE FROM `lists` WHERE `lists`.`id` = 4