app/controllers/tasks_controller.rb

INSERT INTO `tasks` (`description`, `completed`, `list_id`, `created_at`, `updated_at`) VALUES ('Buy a padlock for back gate', NULL, 1, '2012-08-11 10:06:29', '2012-08-11 10:06:29')
---
  def create

    @task = @list.tasks.new(params[:task])
    if @task.save

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1 AND (`tasks`.list_id = 1) LIMIT 1
UPDATE `tasks` SET `completed` = 1, `updated_at` = '2012-08-11 10:34:55' WHERE `tasks`.`id` = 1
---
  def complete
    @task = @list.tasks.find(params[:id])
    @task.completed = true
    @task.save

SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 1 LIMIT 1
---
  def find_list
    @list = List.find(params[:list_id])